## Последняя цифра
Циклический сдвиг вправо

### Входные данные
Сначала задано число n - количество элементов в массиве (1 ≤ n ≤ 35).
Далее через пробел записаны n чисел - элементы массива.
Массив состоит из целых чисел.

### Выходные данные
Необходимо вывести массив, полученный после сдвига элементов.

#### STDIN
    6
    4 5 3 4 2 3
#### STDOUT
    3 4 5 3 4 2

### Решение (Python)
    input()
    a = [int(i) for i in input().split()]
    a = [a[-1]] + a[:len(a)-1]
    print(*a)

### Решение (C++)
```
#include <iostream>

int main(){
    int n;
    std::cin >> n;
    int m[n];
    for (int i = 0; i < n; i++){
        std::cin >> m[i];
    }
    for (int i = n - 1; i >= 1; i--){
        std::swap(m[i], m[i-1]);
    }
    for (int i = 0; i < n; i++){
        std::cout << m[i] << " ";
    }
}
```
