## Ревизия
В связи с визитом Императора Палпатина было решено обновить состав дроидов в ангаре 32. 
Из-за кризиса было решено новых дроидов не закупать, но выкинуть пару старых. 
Как известно, Палпатин не переносит дроидов с маленькими серийными номерами, 
так что все, что требуется - найти среди них двух, у которых серийные номера наименьшие.

### Входные данные
Первая строка входного файла содержит целое число n - количество дроидов.
(2 ≤ n ≤ 1000), вторая строка - n целых чисел, 
по модулю не превышающих 2*10^9 - номера дроидов.
### Выходные данные
Выведите два числа: сначала последний по величине из номеров дроидов 
(такого следует утилизировать в первую очередь), а затем – предпоследний.

#### STDIN
```
5
10 2 3 1 5
```
#### STDOUT
```
1 2
```

#### Примечание
Необходимо решить задачу без использования сортировок! 
Так как дроиды старые, серийные номера могут совпадать.

### Решение (Python)
```
input()
a = [int(i) for i in input().split()]
m1 = float('inf')
m2 = float('inf')
for i in range(len(a)):
    if a[i] <= m1:
        m2 = m1
        m1 = a[i]
    elif a[i] <= m2:
        m2 = a[i]
print(m1, m2)
```
