## Количество элементов больших обоих соседей
Дан массив, состоящий из целых чисел. Напишите программу, 
которая в данном массиве определит количество элементов, 
у которых два соседних элемента меньше данного.

### Входные данные
Сначала задано число n - количество элементов в массиве (1 ≤ n ≤ 100).
Далее через пробел записаны n чисел - элементы массива. Массив состоит из
целых чисел, не превышающих 10^9.
### Выходные данные
Необходимо вывести количество элементов массива, 
у которых два соседа и которые при этом строго больше обоих своих соседей.

#### STDIN (1)
```
5
1 2 3 4 5
```
#### STDOUT (1)
```
0
```

#### STDIN (2)
```
5
1 5 1 5 1
```
#### STDOUT (2)
```
2
```

### Решение (Python)
```
input()
a = [int(i) for i in input().split()]
k = 0
for i in range(1, len(a) - 1):
    if a[i - 1] < a[i] and a[i + 1] < a[i]:
        k +=1
print(k)
```
