## Ближайшее число
Напишите программу, которая находит в массиве элемент, 
самый близкий по величине к данному числу.

### Входные данные
В первой строке задается одно натуральное число n, не превосходящее 1000 – размер массива.
Во второй строке содержатся n чисел – элементы массива (целые числа, не превосходящие по модулю 1000).
В третьей строке вводится одно целое число x, не превосходящее по модулю 1000.
### Выходные данные
Вывести значение элемента массива, ближайшее к x. 
Если таких чисел несколько, выведите любое из них.

#### STDIN (1)
```
5
1 2 3 4 5
6
```
#### STDOUT (1)
```
5
```

#### STDIN (2)
```
5
5 4 3 2 1
3
```
#### STDOUT (2)
```
3
```

### Решение (Python)
```
input()
a = [int(i) for i in input().split()]
goal = int(input())
dif = float('inf')
for i in range(len(a)):
    if abs(a[i] - goal) <= abs(dif):
        dif = a[i] - goal
print(goal + dif)
```
