## Структура Холодильник
Написать структуру для хранения информации о холодильнике (fridge).

Должна быть возможность узнать, сколько в нем лежит:
* литров молока
* кг мяса
* кусочков сыра
* кусочков вашей любимой вкусняшки

В вашей реализации должна быть написана сама структура, создание двух ее объектов и работа с ними (сложить что-то туда, убрать что-то оттуда)

### Входные данные
Отсутствуют
### Выходные данные
Отсутствуют

#### STDIN
```
```
#### STDOUT
```
```

### Решение (C++)
```
#include <iostream>

struct Fridge{
public:
    void fridge(int milk, int meat, int cheese, int chocolate){
        milk = milk;
        meat = meat;
        cheese = cheese;
        chocolate = chocolate;
    }
    void addMilk(int c){
        if (c >= 0){
            milk += c;
        } else {
            std::cout << "Невозможно добавить отрицательное кол-во литров, воспользуйтесь useMilk()\n";
        }
    }
    void useMilk(int c){
        if (c >= 0){
            if (milk - c >= 0) {
                milk -= c;
            } else {
                std::cout << "В холодильнике нет " << c << " литров молока\n";
            }
        } else {
            std::cout << "Невозможно вылить отрицательное кол-во литров, воспользуйтесь addMilk()\n";
        }
    }
    void addMeat(int c){
        if (c >= 0){
            meat += c;
        } else {
            std::cout << "Невозможно добавить отрицательное кол-во кг, воспользуйтесь useMeat()\n";
        }
    }
    void useMeat(int c){
        if (c >= 0){
            if (meat - c >= 0) {
                meat -= c;
            } else {
                std::cout << "В холодильнике нет " << c << " кг мяса\n";
            }
        } else {
            std::cout << "Невозможно убрать отрицательное кол-во кг, воспользуйтесь addMeat()\n";
        }
    }
    void addCheese(int c){
        if (c >= 0){
            cheese += c;
        } else {
            std::cout << "Невозможно добавить отрицательное кол-во кг, воспользуйтесь useCheese()\n";
        }
    }
    void useCheese(int c){
        if (c >= 0){
            if( cheese - c >= 0) {
                cheese -= c;
            } else {
                std::cout << "В холодильнике нет " << c << " кг сыра\n";
            }
        } else {
            std::cout << "Невозможно убрать отрицательное кол-во кг, воспользуйтесь addCheese()\n";
        }
    }
    void addChocolate(int c){
        if (c >= 0){
            chocolate += c;
        } else {
            std::cout << "Невозможно добавить отрицательное кол-во кг, воспользуйтесь useChocolate()\n";
        }
    }
    void useChocolate(int c){
        if (c >= 0){
            if (chocolate - c >= 0){
                chocolate -= c;
            } else {
                std::cout << "В холодильнике нет " << c << " кг шоколада\n";
            }
        } else {
            std::cout << "Невозможно убрать отрицательное кол-во кг, воспользуйтесь addChocolate()\n";
        }
    }

private:
    int milk = 0; // кол-во литров молока
    int meat = 0; // кол-во кг мяса
    int cheese = 0; // кол-во кусочков сыра
    int chocolate = 0; // кол-во кусочков шоколада
};

int main() {
    Fridge mine, mom;

    mine.fridge(0, 0, 0, 0);
    mom.fridge(0, 0, 0, 0);

    mine.addCheese(10);
    mom.addChocolate(3);

    mom.addMilk(3);
    mine.useCheese(4);

    return 0;
}
```
