## Вставка числа
Требуется вставить в данный массив на данное место данный элемент,
сдвинув остальные элементы вправо.

### Входные данные
В первой строке вводится одно натуральное число, не превосходящее 1000 – размер массива. 
Во второй строке задаются n чисел – элементы массива (целые числа, не превосходящие по модулю 1000). 
В третьей строке вводится число, которое необходимо вставить, и номер места, на которое его нужно вставить.
### Выходные данные
Вывести получившийся массив.

#### STDIN
```
5
1 2 3 4 5
2 3
```
#### STDOUT
```
1 2 2 3 4 5
```

### Решение (Python)
```
n = int(input())
a = [int(i) for i in input().split()]
t = [int(i) for i in input().split()]
a = a[0:t[1] - 1] + [t[0]] + a[t[1] - 1:]
print(*a)
```
