## Очередь
Реализуйте работу очереди. Для каждой операции изъятия элемента выведите ее результат.
На вход программе подаются строки, содержащие команды. 
Каждая строка содержит одну команду. Команды бывают двух видов:

* \+ x – добавить в очередь число x (−10^9 < x < 10^9).
* \- – изъять элемент из очереди. Гарантируется, что не происходит извлечения из пустой очереди.

Гарантируется, что размер очереди в процессе выполнения команд не превысит 10^6 элементов.

### Входные данные
В первой строке содержится количество команд n (1 ≤ n ≤ 10^6). 
Каждая последующая строка исходного файла содержит ровно одну команду.
### Выходные данные
Выведите числа, которые удаляются из очереди, по одному в каждой строке.

#### STDIN
```
4
+ 1
+ 10
-
-
```
#### STDOUT
```
1
10
```

### Решение (C++)
```
#include <iostream>

struct node {
    int value;
    node* right;

    node(int x) {
        value = x;
        right = nullptr;
    }
};

struct queue {
    node* first;
    node* last;

    queue() {
        first = nullptr;
        last = nullptr;
    }

    void push_back(int x) {
        
        node* nodeTemp = new node(x);
        
        if (first == nullptr) {
            first = last = nodeTemp;
            return;
        }

        last->right = nodeTemp;
        last = nodeTemp;
    }

    int pop() {
        int result = first->value;
        node* temp = first;
        first = first->right;
        delete temp;
        return result;

    }
};

int main(){
    srand(time(0));
    std::ios::sync_with_stdio(false);
    std::cin.tie(NULL);
    std::cout.tie(NULL);

    int n;
    queue st;
    std::cin >> n;
    for (int i = 0; i < n; i++) {
        char c;
        std::cin >> c;
        if (c == '-') {
            std::cout << st.pop() << "\n";
        } else {
            int num;
            std::cin >> num;
            st.push_back(num);
        }
    }
}
```
