## Стек
Реализуйте работу стэка. Для каждой операции изъятия элемента выведите ее результат.
На вход программе подаются строки, содержащие команды. 
Каждая строка содержит одну команду. Команды бывают двух видов:

* \+ x – добавить в очередь число x (−10^9 < x < 10^9).
* \- – изъять элемент из очереди. Гарантируется, что не происходит извлечения из пустой очереди.

Гарантируется, что размер очереди в процессе выполнения команд не превысит 10^6 элементов.

### Входные данные
В первой строке содержится количество команд n (1 ≤ n ≤ 10^6). 
Каждая последующая строка исходного файла содержит ровно одну команду.
### Выходные данные
Выведите числа, которые удаляются из стэка, по одному в каждой строке.

#### STDIN
```
6
+ 1
+ 10
-
+ 2
+ 1234
-
```
#### STDOUT
```
10
1234
```

### Решение (C++)
```
#include <iostream>

struct node {
    int value;
    node* left;

    node(int x) {
        left = nullptr;
    }
};

struct stack {
    node* last;

    stack() {
        last = nullptr;
    }

    void push_back(int x) {
        node* tmp = new node(x);

        if (last == nullptr) {
            tmp->value = x;
            last = tmp;
            return;
        }

        tmp->left = last;
        tmp->value = x;
        last = tmp;
    }

    int pop() {
        node* tmp = last;
        int result = last->value;
        last = last->left;
        delete tmp;
        return result;
    }
};

int main(){
    srand(time(0));
    std::ios::sync_with_stdio(false);
    std::cin.tie(NULL);
    std::cout.tie(NULL);

    int n;
    stack st;
    std::cin >> n;
    for (int i = 0; i < n; i++) {
        char c;
        std::cin >> c;
        if (c == '-') {
            std::cout << st.pop() << "\n";
        } else {
            int num;
            std::cin >> num;
            st.push_back(num);
        }
    }
}
```
