## Правильная скобочная последовательность
Входные данные содержат несколько строк, каждая из которых содержит последовательность символов (, ), [ и ]. 
Выясните, является ли она правильной скобочной последовательностью с двумя типами скобок.

Подсказка: используйте стек.

### Входные данные
Не более 500 строк, каждая из которых содержит скобочную последовательность длиной не более чем в 10^4 символов.
### Выходные данные
Для каждой строки входных данных выведите в выходной файл YES, 
если соответствующая последовательность является правильной скобочной последовательностью, или NO, если не является.

#### STDIN
```
()()
([])
([)]
((]]
)(
```
#### STDOUT
```
YES
YES
NO
NO
NO
```

### Решение (C++)
```
#include <iostream>

template<typename T>
struct node {
    T value;
    node* left;

    node(T x) {
        left = nullptr;
    }
};

template<typename T>
struct stack {
    node<T>* last;
    int size = 0;

    stack() {
        last = nullptr;
    }

    void push_back(T x) {
        node<T>* tmp = new node(x);

        size++;
        if (last == nullptr) {
            tmp->value = x;
            last = tmp;
            return;
        }

        tmp->left = last;
        tmp->value = x;
        last = tmp;
    }

    int pop() {
        size--;
        node<T>* tmp = last;
        T result = last->value;
        last = last->left;
        delete tmp;
        return result;
    }

    int cs() {
        return size;
    }

    T peek() {
        return last->value;
    }
};

std::string check(std::string a) {
    stack<char> st;
    bool flag = true;
    for (char c : a) {
        if (c == '(' || c == '[') {
            st.push_back(c);
        } else {
            if (st.cs() == 0) {
                flag = false;
                break;
            } else {
                if (st.peek() == '(' && c == ')'){
                    st.pop();
                } else if (st.peek() == '[' && c == ']'){
                    st.pop();
                } else {
                    flag = false;
                    break;
                }
            }
        }
    }
    if (st.cs() != 0) {
        flag = false;
    }

    if (flag) {
        return "YES";
    } else {
        return "NO";
    }

}

int main(){
    srand(time(0));
    std::ios::sync_with_stdio(false);
    std::cin.tie(NULL);
    std::cout.tie(NULL);

    std::string str;
    while (std::cin >> str) {
        std::cout << check(str) << '\n';
    }
}
```
