## Анти-QuickSort
Для сортировки последовательности чисел широко используется быстрая сортировка - QuickSort.
Хотя QuickSort является самой быстрой сортировкой в среднем, существуют тесты, на которых она работает очень долго.
Требуется написать программу, генерирующую тест, на котором быстрая сортировка сделает наибольшее число таких сравнений.

### Входные данные
В первой строке находится единственное число n (1 ≤ n ≤ 70000).
### Выходные данные
Вывести перестановку чисел от 1 до n, на которой быстрая сортировка выполнит максимальное число сравнений. 
Если таких перестановок несколько, вывести любую из них.
#### STDIN
```
3
```
#### STDOUT
```
1 3 2
```

### Решение (Python)
```
def AntiQuickSort(n):
    a = list(range(1, n + 1))
    for i in range(2, n):
        a[i], a[i//2] = a[i//2], a[i]
    return a
a = AntiQuickSort(int(input()))
print(*a)
```
