## Сортировка вставками
Требуется отсортировать массив по неубыванию методом "вставок".

### Входные данные
В первой строке вводится одно натуральное число, не превосходящее 1000 – размер массива. 
Во второй строке задаются n чисел – элементы массива (целые числа, не превосходящие по модулю 1000).
### Выходные данные
Вывести получившийся массив.

#### STDIN
```
5
5 4 3 2 1
```
#### STDOUT
```
1 2 3 4 5 
```

### Решение (C++)
```
#include <iostream>

int main(){
    int n;
    std::cin >> n;
    int m[n];
    for (int i = 0; i < n; i++){
        std::cin >> m[i];
    }
    int j;
    for (int i = 1; i < n; i++){
        j = i - 1;
        while (j>= 0 and m[j] > m[j + 1]){
            std::swap(m[j], m[j + 1]);
            j--;
        }
    }
    for (int i = 0; i < n; i++){
        std::cout << m[i] << ' ';
    }
}
```
