## Библиотечный метод
Продемонстрируйте работу метода сортировки вставками по возрастанию. 
Для этого выведите состояние данного массива после каждой вставки на отдельных строках. 
Если массив упорядочен изначально, то следует не выводить ничего.

### Входные данные
На первой строке дано число (1≤n≤100) – количество элементов в массиве. 
На второй строке задан сам массив: последовательность натуральных чисел, не превышающих 10^9.
### Выходные данные
Выведите строки (по количеству вставок) по N чисел каждая.

#### STDIN (1)
```
2
2 1
```
#### STDOUT (1)
```
1 2
```

#### STDIN (2)
```
4
2 1 5 3
```
#### STDOUT (2)
```
1 2 5 3 
1 2 3 5
```

### Решение (C++)
```
#include <iostream>

void printMas(int m[], int n){
    for (int i = 0; i < n; i++){
        std::cout << m[i] << " ";
    }
    std::cout << '\n';
}
int main(){
    int n;
    std::cin >> n;
    int m[n];
    for (int i = 0; i < n; i++){
        std::cin >> m[i];
    }
    int j;
    bool tmp = false;
    for (int i = 1; i < n; i++){
        j = i - 1;
        while (j>= 0 and m[j] > m[j + 1]){
            std::swap(m[j], m[j + 1]);
            j--;
            tmp = true;
        }
        if (tmp){
            printMas(m, n);
            tmp = false;
        }
    }
}
```
