## Сортировка слиянием
Отсортируйте данный массив, используя сортировку слиянием.

### Входные данные
Первая строка входных данных содержит число n – количество элементов в массиве. (1 ≤ n ≤ 10^5). 
Далее идет n целых чисел, не превосходящих по абсолютной величине 10^9.
### Выходные данные
Выведите эти числа в порядке неубывания.

#### STDIN
```
2
3 1
```
#### STDOUT
```
1 3
```

### Решение (C++)
```
#include <iostream>
void merge(int a[], int left, int mid, int right);

void mergeSort(int a[], int left, int right) {
    if (left + 1 >= right) {
        return;
    }
    int mid = (left + right) / 2;
    mergeSort(a, left, mid);
    mergeSort(a, mid, right);
    merge(a, left, mid, right);
}
void merge(int a[], int left, int mid, int right){
    int it1 = 0;
    int it2 = 0;

    int result[right - left];
    while ((left + it1 < mid) and (mid + it2 < right)){
        if (a[left + it1] < a[mid + it2]){
            result[it1 + it2] = a[left + it1];
            it1++;
        } else {
            result[it1 + it2] = a[mid + it2];
            it2++;
        }
    }
    while (left + it1 < mid){
        result[it1 + it2] = a[left + it1];
        it1++;
    }
    while (mid + it2 < right){
        result[it1 + it2] = a[mid + it2];
        it2++;
    }
    for (int i = 0; i < it1 + it2; i++){
        a[left + i] = result[i];
    }
}

int main(){
    int n;
    std::cin >> n;
    int m[n];
    for (int i = 0; i < n; i++){
        std::cin >> m[i];
    }
    mergeSort(m, 0, n);
    for (int i = 0; i < n; i++){
        std::cout << m[i] << ' ';
    }
}
```
