## Быстрая сортировка
Отсортируйте данный массив, используя быструю сортировку.

### Входные данные
Первая строка входных данных содержит число n – количество элементов в массиве. (1 ≤ n ≤ 10^5). 
Далее идет n целых чисел, не превосходящих по абсолютной величине 10^9.
### Выходные данные
Выведите эти числа в порядке неубывания.

#### STDIN
```
2
3 1
```
#### STDOUT
```
1 3
```

### Решение (Python)
```
def QuickSort(a):
    if len(a) == 0:
        return a
    
    b = a[len(a) // 2]
    al = []
    ar = []
    for i in range(len(a)):
        if (i != len(a) // 2):
            if a[i] <= b:
                al.append(a[i])
            else:
                ar.append(a[i])
    
    return QuickSort(al) + [b] + QuickSort(ar)

input()
a = [int(i) for i in input().split()]
print(*QuickSort(a))
```
